<?php
//******************************************************************************
// 機能名   ： コマンドメッセージクラス
//              コマンドへのパラメータ及びリターンオブジェクト
// 作成日   ： 2005.04.19
//******************************************************************************
class CommandMessage {

    //*** 変数定義 ***//
    var $param = array();   // (Hashmap)保持データ
    var $errMsg;            // (Hashmap)エラーメッセージ

    //******************************************************************************
    // 関数名   ： ActionInterface
    // 機能名   ： コンストラクタ
    // 引　数   ： なし
    // 戻り値   ： なし
    //******************************************************************************
    function CommandMessage () {
        //*** 変数の初期化 ***//
        $this->param = array();
        $this->errMsg = array();
    }

    //******************************************************************************
    // 関数名   ：  setParameter
    // 機能名   ：  パラメータSetter
    // 引　数   ：  $input          (Hashmap)入力値
    // 戻り値   ：  なし
    // 備　考   ：  
    //******************************************************************************
    function setParameter ($input) {
        if (is_array($input)) {
            foreach ($input as $n => $v) {
                $this->param[$n] = $input[$n];
            }
        } else {
            $this->param = $input;
        }
    }

    //******************************************************************************
    // 関数名   ：  getParameter
    // 機能名   ：  パラメータGetter
    // 引　数   ：  なし
    // 戻り値   ：  $param          (Hashmap)保持データ
    // 備　考   ：  
    //******************************************************************************
    function getParameter () {
        return $this->param;
    }

    //******************************************************************************
    // 関数名   ：  setErrMsg
    // 機能名   ：  エラーメッセージリストSetter
    // 引　数   ：  $msg            (Hashmap)エラーメッセージ
    // 戻り値   ：  なし
    // 備　考   ：  
    //******************************************************************************
    function setErrMsg ($msg) {
        $this->errMsg = $msg;
    }

    //******************************************************************************
    // 関数名   ：  getErrMsg
    // 機能名   ：  エラーメッセージリストGetter
    // 引　数   ：  なし
    // 戻り値   ：  $this->errMsg   (Hashmap)エラーメッセージ
    // 備　考   ：  
    //******************************************************************************
    function getErrMsg () {
        return $this->errMsg;
    }

    //******************************************************************************
    // 関数名   ：  isSuccess
    // 機能名   ：  Command実行結果判定
    // 引　数   ：  なし
    // 戻り値   ：  なし
    // 備　考   ：  
    //******************************************************************************
    function isSuccess () {
        $rslt = true;
        if (sizeof($this->errMsg)) {
            $rslt = false;
        }
        return $rslt;
    }
}
?>